ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_cpu1_ipc_send_regs.xml
		<register id="CPU1TOCPU3INTIPCSENDDATA" width="32" page="0" offset="0x18" instances="1" instaddr="4" internal="0" description="CPU1TOCPU3INTIPCSENDDATA Register">
			<bitfield id="DATA" description="CPU1 to CPU3 IPC Data" begin="31" end="0" width="32" rwaccess="RW"/>
		</register>
		<register id="CPU3TOCPU1INTREMOTEREPLY" width="32" page="0" offset="0x1c" instances="1" instaddr="4" internal="0" description="CPU3TOCPU1INTREMOTEREPLY Register">
			<bitfield id="REPLY" description="Refelects the state of CPU3TOCPU1INT IPCREPLY register" begin="31" end="0" width="32" rwaccess="R"/>
		</register>
	</group>
	<group id="CPU1_IPC_SEND_REGS_RegisterFile2" name="CPU1_IPC_SEND_REGS_RegisterFile2" instances="2" offset="0x6000" instaddr="4096">
		<register id="CPU1TOHSMINTIPCSET" width="32" page="0" offset="0x0" instances="1" instaddr="4" internal="0" description="CPU1TOHSMINTIPCSET Register">
			<bitfield id="IPC0" description="Set Remote IPC0 Flag" begin="0" end="0" width="1" rwaccess="RW"/>
			<bitfield id="IPC1" description="Set Remote IPC1 Flag" begin="1" end="1" width="1" rwaccess="RW"/>
			<bitfield id="IPC2" description="Set Remote IPC2 Flag" begin="2" end="2" width="1" rwaccess="RW"/>
			<bitfield id="IPC3" description="Set Remote IPC3 Flag" begin="3" end="3" width="1" rwaccess="RW"/>
			<bitfield id="IPC4" description="Set Remote IPC4 Flag" begin="4" end="4" width="1" rwaccess="RW"/>
			<bitfield id="IPC5" description="Set Remote IPC5 Flag" begin="5" end="5" width="1" rwaccess="RW"/>
			<bitfield id="IPC6" description="Set Remote IPC6 Flag" begin="6" end="6" width="1" rwaccess="RW"/>
			<bitfield id="IPC7" description="Set Remote IPC7 Flag" begin="7" end="7" width="1" rwaccess="RW"/>
			<bitfield id="IPC8" description="Set Remote IPC8 Flag" begin="8" end="8" width="1" rwaccess="RW"/>
			<bitfield id="IPC9" description="Set Remote IPC9 Flag" begin="9" end="9" width="1" rwaccess="RW"/>
			<bitfield id="IPC10" description="Set Remote IPC10 Flag" begin="10" end="10" width="1" rwaccess="RW"/>
			<bitfield id="IPC11" description="Set Remote IPC11 Flag" begin="11" end="11" width="1" rwaccess="RW"/>
			<bitfield id="IPC12" description="Set Remote IPC12 Flag" begin="12" end="12" width="1" rwaccess="RW"/>
			<bitfield id="IPC13" description="Set Remote IPC13 Flag" begin="13" end="13" width="1" rwaccess="RW"/>
			<bitfield id="IPC14" description="Set Remote IPC14 Flag" begin="14" end="14" width="1" rwaccess="RW"/>
			<bitfield id="IPC15" description="Set Remote IPC15 Flag" begin="15" end="15" width="1" rwaccess="RW"/>
			<bitfield id="IPC16" description="Set Remote IPC16 Flag" begin="16" end="16" width="1" rwaccess="RW"/>
			<bitfield id="IPC17" description="Set Remote IPC17 Flag" begin="17" end="17" width="1" rwaccess="RW"/>
			<bitfield id="IPC18" description="Set Remote IPC18 Flag" begin="18" end="18" width="1" rwaccess="RW"/>
			<bitfield id="IPC19" description="Set Remote IPC19 Flag" begin="19" end="19" width="1" rwaccess="RW"/>
			<bitfield id="IPC20" description="Set Remote IPC20 Flag" begin="20" end="20" width="1" rwaccess="RW"/>
			<bitfield id="IPC21" description="Set Remote IPC21 Flag" begin="21" end="21" width="1" rwaccess="RW"/>
			<bitfield id="IPC22" description="Set Remote IPC22 Flag" begin="22" end="22" width="1" rwaccess="RW"/>
			<bitfield id="IPC23" description="Set Remote IPC23 Flag" begin="23" end="23" width="1" rwaccess="RW"/>
			<bitfield id="IPC24" description="Set Remote IPC24 Flag" begin="24" end="24" width="1" rwaccess="RW"/>
			<bitfield id="IPC25" description="Set Remote IPC25 Flag" begin="25" end="25" width="1" rwaccess="RW"/>
			<bitfield id="IPC26" description="Set Remote IPC26 Flag" begin="26" end="26" width="1" rwaccess="RW"/>
			<bitfield id="IPC27" description="Set Remote IPC27 Flag" begin="27" end="27" width="1" rwaccess="RW"/>
			<bitfield id="IPC28" description="Set Remote IPC28 Flag" begin="28" end="28" width="1" rwaccess="RW"/>
			<bitfield id="IPC29" description="Set Remote IPC29 Flag" begin="29" end="29" width="1" rwaccess="RW"/>
			<bitfield id="IPC30" description="Set Remote IPC30 Flag" begin="30" end="30" width="1" rwaccess="RW"/>
			<bitfield id="IPC31" description="Set Remote IPC31 Flag" begin="31" end="31" width="1" rwaccess="RW"/>
		</register>
		<register id="CPU1TOHSMINTIPCCLR" width="32" page="0" offset="0x4" instances="1" instaddr="4" internal="0" description="CPU1TOHSMINTIPCCLR Register">
			<bitfield id="IPC0" description="Clear CPU1TOHSMIPCFLG.IPC0 Flag" begin="0" end="0" width="1" rwaccess="RW"/>
			<bitfield id="IPC1" description="Clear CPU1TOHSMIPCFLG.IPC1 Flag" begin="1" end="1" width="1" rwaccess="RW"/>
			<bitfield id="IPC2" description="Clear CPU1TOHSMIPCFLG.IPC2 Flag" begin="2" end="2" width="1" rwaccess="RW"/>
			<bitfield id="IPC3" description="Clear CPU1TOHSMIPCFLG.IPC3 Flag" begin="3" end="3" width="1" rwaccess="RW"/>
			<bitfield id="IPC4" description="Clear CPU1TOHSMIPCFLG.IPC4 Flag" begin="4" end="4" width="1" rwaccess="RW"/>
			<bitfield id="IPC5" description="Clear CPU1TOHSMIPCFLG.IPC5 Flag" begin="5" end="5" width="1" rwaccess="RW"/>
			<bitfield id="IPC6" description="Clear CPU1TOHSMIPCFLG.IPC6 Flag" begin="6" end="6" width="1" rwaccess="RW"/>
			<bitfield id="IPC7" description="Clear CPU1TOHSMIPCFLG.IPC7 Flag" begin="7" end="7" width="1" rwaccess="RW"/>
			<bitfield id="IPC8" description="Clear CPU1TOHSMIPCFLG.IPC8 Flag" begin="8" end="8" width="1" rwaccess="RW"/>
			<bitfield id="IPC9" description="Clear CPU1TOHSMIPCFLG.IPC9 Flag" begin="9" end="9" width="1" rwaccess="RW"/>
			<bitfield id="IPC10" description="Clear CPU1TOHSMIPCFLG.IPC10 Flag" begin="10" end="10" width="1" rwaccess="RW"/>
			<bitfield id="IPC11" description="Clear CPU1TOHSMIPCFLG.IPC11 Flag" begin="11" end="11" width="1" rwaccess="RW"/>
			<bitfield id="IPC12" description="Clear CPU1TOHSMIPCFLG.IPC12 Flag" begin="12" end="12" width="1" rwaccess="RW"/>
			<bitfield id="IPC13" description="Clear CPU1TOHSMIPCFLG.IPC13 Flag" begin="13" end="13" width="1" rwaccess="RW"/>
			<bitfield id="IPC14" description="Clear CPU1TOHSMIPCFLG.IPC14 Flag" begin="14" end="14" width="1" rwaccess="RW"/>
			<bitfield id="IPC15" description="Clear CPU1TOHSMIPCFLG.IPC15 Flag" begin="15" end="15" width="1" rwaccess="RW"/>
			<bitfield id="IPC16" description="Clear CPU1TOHSMIPCFLG.IPC16 Flag" begin="16" end="16" width="1" rwaccess="RW"/>
			<bitfield id="IPC17" description="Clear CPU1TOHSMIPCFLG.IPC17 Flag" begin="17" end="17" width="1" rwaccess="RW"/>
			<bitfield id="IPC18" description="Clear CPU1TOHSMIPCFLG.IPC18 Flag" begin="18" end="18" width="1" rwaccess="RW"/>
			<bitfield id="IPC19" description="Clear CPU1TOHSMIPCFLG.IPC19 Flag" begin="19" end="19" width="1" rwaccess="RW"/>
			<bitfield id="IPC20" description="Clear CPU1TOHSMIPCFLG.IPC20 Flag" begin="20" end="20" width="1" rwaccess="RW"/>
			<bitfield id="IPC21" description="Clear CPU1TOHSMIPCFLG.IPC21 Flag" begin="21" end="21" width="1" rwaccess="RW"/>
			<bitfield id="IPC22" description="Clear CPU1TOHSMIPCFLG.IPC22 Flag" begin="22" end="22" width="1" rwaccess="RW"/>
			<bitfield id="IPC23" description="Clear CPU1TOHSMIPCFLG.IPC23 Flag" begin="23" end="23" width="1" rwaccess="RW"/>
			<bitfield id="IPC24" description="Clear CPU1TOHSMIPCFLG.IPC24 Flag" begin="24" end="24" width="1" rwaccess="RW"/>
			<bitfield id="IPC25" description="Clear CPU1TOHSMIPCFLG.IPC25 Flag" begin="25" end="25" width="1" rwaccess="RW"/>
			<bitfield id="IPC26" description="Clear CPU1TOHSMIPCFLG.IPC26 Flag" begin="26" end="26" width="1" rwaccess="RW"/>
			<bitfield id="IPC27" description="Clear CPU1TOHSMIPCFLG.IPC27 Flag" begin="27" end="27" width="1" rwaccess="RW"/>
			<bitfield id="IPC28" description="Clear CPU1TOHSMIPCFLG.IPC28 Flag" begin="28" end="28" width="1" rwaccess="RW"/>
			<bitfield id="IPC29" description="Clear CPU1TOHSMIPCFLG.IPC29 Flag" begin="29" end="29" width="1" rwaccess="RW"/>
			<bitfield id="IPC30" description="Clear CPU1TOHSMIPCFLG.IPC30 Flag" begin="30" end="30" width="1" rwaccess="RW"/>
			<bitfield id="IPC31" description="Clear CPU1TOHSMIPCFLG.IPC31 Flag" begin="31" end="31" width="1" rwaccess="RW"/>
		</register>
		<register id="CPU1TOHSMINTIPCFLG" width="32" page="0" offset="0x8" instances="1" instaddr="4" internal="0" description="CPU1TOHSMINTIPCFLG Register">
			<bitfield id="IPC0" description="HSM to CPU1 IPC0 Flag Status" begin="0" end="0" width="1" rwaccess="R"/>
			<bitfield id="IPC1" description="HSM to CPU1 IPC1 Flag Status" begin="1" end="1" width="1" rwaccess="R"/>
			<bitfield id="IPC2" description="HSM to CPU1 IPC2 Flag Status" begin="2" end="2" width="1" rwaccess="R"/>
			<bitfield id="IPC3" description="HSM to CPU1 IPC3 Flag Status" begin="3" end="3" width="1" rwaccess="R"/>
			<bitfield id="IPC4" description="HSM to CPU1 IPC4 Flag Status" begin="4" end="4" width="1" rwaccess="R"/>
			<bitfield id="IPC5" description="HSM to CPU1 IPC5 Flag Status" begin="5" end="5" width="1" rwaccess="R"/>
			<bitfield id="IPC6" description="HSM to CPU1 IPC6 Flag Status" begin="6" end="6" width="1" rwaccess="R"/>
			<bitfield id="IPC7" description="HSM to CPU1 IPC7 Flag Status" begin="7" end="7" width="1" rwaccess="R"/>
			<bitfield id="IPC8" description="HSM to CPU1 IPC8 Flag Status" begin="8" end="8" width="1" rwaccess="R"/>
			<bitfield id="IPC9" description="HSM to CPU1 IPC9 Flag Status" begin="9" end="9" width="1" rwaccess="R"/>
			<bitfield id="IPC10" description="HSM to CPU1 IPC10 Flag Status" begin="10" end="10" width="1" rwaccess="R"/>
			<bitfield id="IPC11" description="HSM to CPU1 IPC11 Flag Status" begin="11" end="11" width="1" rwaccess="R"/>
			<bitfield id="IPC12" description="HSM to CPU1 IPC12 Flag Status" begin="12" end="12" width="1" rwaccess="R"/>
			<bitfield id="IPC13" description="HSM to CPU1 IPC13 Flag Status" begin="13" end="13" width="1" rwaccess="R"/>
			<bitfield id="IPC14" description="HSM to CPU1 IPC14 Flag Status" begin="14" end="14" width="1" rwaccess="R"/>
			<bitfield id="IPC15" description="HSM to CPU1 IPC15 Flag Status" begin="15" end="15" width="1" rwaccess="R"/>
			<bitfield id="IPC16" description="HSM to CPU1 IPC16 Flag Status" begin="16" end="16" width="1" rwaccess="R"/>
			<bitfield id="IPC17" description="HSM to CPU1 IPC17 Flag Status" begin="17" end="17" width="1" rwaccess="R"/>
			<bitfield id="IPC18" description="HSM to CPU1 IPC18 Flag Status" begin="18" end="18" width="1" rwaccess="R"/>
			<bitfield id="IPC19" description="HSM to CPU1 IPC19 Flag Status" begin="19" end="19" width="1" rwaccess="R"/>
			<bitfield id="IPC20" description="HSM to CPU1 IPC20 Flag Status" begin="20" end="20" width="1" rwaccess="R"/>
			<bitfield id="IPC21" description="HSM to CPU1 IPC21 Flag Status" begin="21" end="21" width="1" rwaccess="R"/>
			<bitfield id="IPC22" description="HSM to CPU1 IPC22 Flag Status" begin="22" end="22" width="1" rwaccess="R"/>
			<bitfield id="IPC23" description="HSM to CPU1 IPC23 Flag Status" begin="23" end="23" width="1" rwaccess="R"/>
			<bitfield id="IPC24" description="HSM to CPU1 IPC24 Flag Status" begin="24" end="24" width="1" rwaccess="R"/>
			<bitfield id="IPC25" description="HSM to CPU1 IPC25 Flag Status" begin="25" end="25" width="1" rwaccess="R"/>
			<bitfield id="IPC26" description="HSM to CPU1 IPC26 Flag Status" begin="26" end="26" width="1" rwaccess="R"/>
			<bitfield id="IPC27" description="HSM to CPU1 IPC27 Flag Status" begin="27" end="27" width="1" rwaccess="R"/>
			<bitfield id="IPC28" description="HSM to CPU1 IPC28 Flag Status" begin="28" end="28" width="1" rwaccess="R"/>
			<bitfield id="IPC29" description="HSM to CPU1 IPC29 Flag Status" begin="29" end="29" width="1" rwaccess="R"/>
			<bitfield id="IPC30" description="HSM to CPU1 IPC30 Flag Status" begin="30" end="30" width="1" rwaccess="R"/>
			<bitfield id="IPC31" description="HSM to CPU1 IPC31 Flag Status" begin="31" end="31" width="1" rwaccess="R"/>
		</register>
	</group>
</module>
